app/command/authenticate_user.rb

SELECT "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "example@mail.com"], ["LIMIT", 1]]
---
  def employee
    employee = Employee.find_by_email(email)