app/command/authorize_api_request.rb

    def employee
        @employee ||= Employee.find(decoded_auth_token[:employee_id]) if decoded_auth_token
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]