app/mailers/post_mailer.rb

SELECT "users"."email" FROM "users"
---
  def post_created
    @greeting = "Hi"
    @user = params[:user]
    @post = params[:post]

    mail(
      from: "support@carsego.com",
      to: User.first.email,
      cc: User.all.pluck(:email),
      bcc: "secret@corsego.com",
      subject: "New post created"
    )