app/controllers/employees_controller.rb

    def index
        @employees=Employee.all
        if(params[:query] != nil)
            @employees = @employees.where(name: params[:query])
---
SELECT "employees".* FROM "employees"
SELECT "employees".* FROM "employees" WHERE "employees"."name" = ? LIMIT ?  [["name", "krishna"], ["LIMIT", 1]]

    def create
        @employee=Employee.new(employee_params)
        employee.reimbursement=call_bursement(@employee.employment_status)
            if @employee.save
---
INSERT INTO "employees" ("name", "email", "address", "department", "phone_number", "employment_status", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        if @employee.update!(employee_params)
---
UPDATE "employees" SET "address" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address", "chennai"], ["updated_at", "2023-03-03 11:42:22.682668"], ["id", 4]]

    def add_expense
            @expense=@employee.expenses.new
            @expense.invoice_number=params[:invoice_number]
            @expense.date=params[:date]
            @expense.description=params[:description]
            @expense.amount=params[:amount]
            @expense.invoice_bill.attach(params[:invoice_bill])

            unless @expense.invoice_bill.save
                render plain: "Bill Not atttached"
                return
            end

            @expense.status=invoice_validator(@expense.invoice_number)
            if @expense.save
---
INSERT INTO "expenses" ("invoice_number", "date", "description", "amount", "created_at", "updated_at", "status", "employee_id", "report_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def invoice_validator(invoice_number)
        PostMailer.with(user: User.first, post: Post.first).post_created
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def add_report
        @report=@employee.reports.create(report_params)
---
INSERT INTO "reports" ("title", "description", "amount", "status", "created_at", "updated_at", "employee_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def edit_report

        @report=@employee.reports.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ?  [["employee_id", 1]]