app/controllers/expenses_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @employee=Employee.find(params[:employee_id])
        @report=@employee.reports.find(params[:report_id])
        @expense=@report.expenses.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."employee_id" = ? AND "expenses"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "expenses" SET "updated_at" = ?, "status" = ? WHERE "expenses"."id" = ?  [["updated_at", "2023-03-05 18:13:08.811085"], ["status", "pending"], ["id", 3]]
---
    def update
        @employee=Employee.find(params[:employee_id])
        @report=@employee.reports.find(params[:report_id])
        @expense=@report.expenses.find(params[:id])
        if @expense.update!(expense_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."report_id" = ? AND "expenses"."id" = ? LIMIT ?  [["report_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def destroy
        @employee=Employee.find(params[:employee_id])
            @report=@employee.reports.find(params[:report_id])
            @expense=@report.expenses.find(params[:id])

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_comment
        @expense=Expense.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."employee_id" = ? AND "expenses"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "expense_id", "report_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", " kumar"], ["comment", "this expense is too much"], ["created_at", "2023-02-28 18:28:57.999370"], ["updated_at", "2023-02-28 18:28:57.999370"], ["expense_id", 1], ["report_id", nil]]
---
    def add_comment
        @employee=Employee.find(params[:employee_id])
        @expense=@employee.expenses.find(params[:id])
        @comment=@expense.comments.new
        @comment.name=params[:name]
        @comment.comment=params[:comment]

        if @comment.save