app/controllers/reports_controller.rb

    def show
        @employee=Employee.find(params[:employee_id])
        @report=@employee.reports.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]

    def get_comment
    @report=Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def add_comment
        @employee=Employee.find(params[:employee_id])
        @report=@employee.reports.find(params[:id])
        @comment=@report.comments.new
        @comment.name=params[:name]
        @comment.comment=params[:comment]

        if @comment.save
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "expense_id", "report_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "frjn"], ["comment", "ddce"], ["created_at", "2023-03-04 14:58:48.155763"], ["updated_at", "2023-03-04 14:58:48.155763"], ["expense_id", nil], ["report_id", 1]]

    def get_expense
        @employee=Employee.find(params[:id])
        @report=Report.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def add_expense
            @employee=Employee.find(params[:employee_id])
            @report=@employee.reports.find(params[:id])
            @expense=@report.expenses.new
            @expense.invoice_number=params[:invoice_number]
            @expense.date=params[:date]
            @expense.description=params[:description]
            @expense.amount=params[:amount]
            @expense.invoice_bill.attach(params[:invoice_bill])

            puts "============================================"
            unless @expense.invoice_bill.save
                puts "Bill Not atttached"
            end
            @expense.status=invoice_validator(@expense.invoice_number)

            puts @report.inspect
            if @expense.save
                @report.amount += params[:amount].to_i
                @report.save
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "expenses" ("invoice_number", "date", "description", "amount", "created_at", "updated_at", "status", "employee_id", "report_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "reports" SET "amount" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["amount", 300], ["updated_at", "2023-03-05 18:29:40.247994"], ["id", 6]]

    def invoice_validator(invoice_number)
        PostMailer.with(user: User.first, post: Post.first).post_created
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def edit_report
        @employee=Employee.find(params[:employee_id])
        @report=@employee.reports.find(params[:id])

        if @report.update!(report_params)
            if(@report.status == "rejected")
                @report.expenses.each do |expense|
                    expense.status ="rejected"
                    expense.save
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."employee_id" = ? AND "reports"."id" = ? LIMIT ?  [["employee_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "reports" SET "amount" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["amount", 100], ["updated_at", "2023-03-06 08:52:16.352039"], ["id", 9]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."report_id" = ?  [["report_id", 9]]
UPDATE "expenses" SET "updated_at" = ?, "status" = ? WHERE "expenses"."id" = ?  [["updated_at", "2023-03-06 08:55:26.199707"], ["status", "rejected"], ["id", 75]]